"""Chronography - chronology

甲子纪年：
    '甲子', '乙丑', '丙寅', '丁卯', '戊辰', '己巳', '庚午', '辛未', '壬申', '癸酉',
    '甲戌', '乙亥', '丙子', '丁丑', '戊寅', '己卯', '庚辰', '辛巳', '壬午', '癸未',
    '甲申', '乙酉', '丙戌', '丁亥', '戊子', '己丑', '庚寅', '辛卯', '壬辰', '癸巳',
    '甲午', '乙未', '丙申', '丁酉', '戊戌', '己亥', '庚子', '辛丑', '壬寅', '癸卯',
    '甲辰', '乙巳', '丙午', '丁未', '戊申', '己酉', '庚戌', '辛亥', '壬子', '癸丑', 
    '甲寅', '乙卯', '丙辰', '丁巳', '戊午', '己未', '庚申', '辛酉', '壬戌', '癸亥'

干支计时：
    子时（夜11至1点）   丑时（后半夜1至3点）寅时（后半夜3至5点）卯时（早晨5至7点）
    辰时（早晨7至9点）  巳时（上午9至11点） 午时（上午11至1点） 未时（下午1至3点）  
    申时（下午3至5点）  酉时（下午5至7点）  戌时（晚7至9点）    亥时（晚9至11点）
"""


# 最近一次的甲子年
YEAR = 1984
# 天干
HEAVENLY = ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸']
# 地支
EARTHLY = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥']
# 十二生肖
SIGNS = ['鼠', '牛', '虎', '兔', '龙', '蛇', '马', '羊', '猴', '鸡', '狗', '猪']


def year(y):
    n = y - 3
    return HEAVENLY[n % 10 - 1] + EARTHLY[n % 12 - 1]


def sign(y):
    return SIGNS[(y - 3) % 12 - 1]


def birthdates(birthdate):
    """获取生辰八字
    
    Args: 
        birthdate (str): 年月日时（%Y%m%d%H: 2001102312）

    Returns: 年月日时四柱干支
    """
    pass


def chronologies():
    """返回甲子纪年表"""
    HE = []
    i = j = 0
    while True:
        he = HEAVENLY[i] + EARTHLY[j]
        if he in HE:
            break
        HE.append(he)
        i = 0 if i == 9 else i + 1
        j = 0 if j == 11 else j + 1
    return HE